tangyangguang/FarmAuto/firmware/master-esp32/src/webapp/fa_master_web.cpp
void sendDoorStopApi(void) {
    if (!Esp32BaseWeb::checkPostAllowed("door_stop")) {
        return;
    }
    if (g_rs485_master == nullptr || g_transport == nullptr) {
        Esp32BaseWeb::sendJson(503, "{\"ok\":false,\"error\":\"service_unavailable\"}");
        return;
    }
    const FaDoorDeviceConfig config = readDoorConfig();
    if (!g_transport->isReady()) {
        Esp32BaseWeb::sendJson(503, "{\"ok\":false,\"transport\":\"not_configured\"}");
        return;
    }

    uint8_t request[FA_MAX_FRAME_LEN];
    size_t request_len = 0u;
    uint8_t seq = 0u;
    const FaFrameResult frame_result = fa_rs485_master_build_stop_action(g_rs485_master,
                                                                        config.station_address,
                                                                        request,
                                                                        sizeof(request),
                                                                        &request_len,
                                                                        &seq);
    if (frame_result != FA_FRAME_OK) {
        sendFeedTransportError(500, "door_stop", "frame", frameResultName(frame_result));
        return;
    }
    FaMasterCommonResponse common;
    if (!transactAndParseCommon(config.station_address, seq, FA_CMD_STOP_ACTION, request, request_len, &common, "door_stop")) {
        return;
    }

    Esp32BaseWeb::sendJson(200, "{\"ok\":true,\"command\":\"stop\",\"message\":\"stop accepted by station\"}");
}

void sendDoorOpenApi(void) {
    sendManualDoorActionApi(FA_DOOR_COMMAND_OPEN);
}

void sendDoorCloseApi(void) {
    sendManualDoorActionApi(FA_DOOR_COMMAND_CLOSE);
}

void sendFeedPage(void) {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }

    const FaFeedDeviceConfig config = readFeedConfig();
    char value[24];

    Esp32BaseWeb::sendHeader("Feed");
    Esp32BaseWeb::sendPageTitle("Manual feed", "Sends one bounded feeder action when RS485 is configured; otherwise previews it.");

    Esp32BaseWeb::beginMetricGrid();
    snprintf(value, sizeof(value), "%u", config.station_address);
    Esp32BaseWeb::sendMetric("Station", value, "RS485 address");
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(config.pulses_per_turn));
    Esp32BaseWeb::sendMetric("Pulses/turn", value);
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(config.grams_per_turn_mg));
    Esp32BaseWeb::sendMetric("mg/turn", value);
    snprintf(value, sizeof(value), "%u", FaActionRecordStore::count());
    Esp32BaseWeb::sendMetric("Records", value, FaActionRecordStore::isReady() ? "LittleFS ring ready" : "Store unavailable");
    Esp32BaseWeb::sendMetric("RS485", g_transport != nullptr && g_transport->isReady() ? "ready" : "not configured");
    Esp32BaseWeb::sendMetric("Action", g_action_runtime != nullptr && g_action_runtime->isBusy() ? "running" : "idle");
    Esp32BaseWeb::endMetricGrid();

    Esp32BaseWeb::beginPanel("Run");
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/feed/manual' onsubmit='return once(this)'><div class='fieldgrid'>");
    Esp32BaseWeb::sendChunk("<div class='field med'><label>Amount</label><input type='number' name='amount' min='1' max='1000000' value='4000'><small>Stored as mg or turns x1000.</small></div>");
    Esp32BaseWeb::sendChunk("<div class='field med'><label>Mode</label><select name='mode'><option value='mg'>mg</option><option value='turns'>turns x1000</option></select><small>Use App Config for calibration.</small></div>");
    Esp32BaseWeb::sendChunk("</div><div class='actions'><input type='submit' value='Run / preview'></div></form>");
    Esp32BaseWeb::endPanel();

    sendActiveActionPanel();
    sendRecentRecordsPanel();

    Esp32BaseWeb::sendInfoRowCompactLink("Feeder parameters", "Station address, pulses/turn, grams/turn and safety limits are stored by Esp32Base App Config.", "App Config", "/esp32base/app-config", "Edit", Esp32BaseWeb::UI_INFO);

    Esp32BaseWeb::sendFooter();
}

void sendDoorPage(void) {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }

    const FaDoorDeviceConfig config = readDoorConfig();
    char value[24];

    Esp32BaseWeb::sendHeader("Door");
    Esp32BaseWeb::sendPageTitle("Manual door", "Sends one bounded motor action for open or close, and can stop the active station action.");

    Esp32BaseWeb::beginMetricGrid();
    snprintf(value, sizeof(value), "%u", config.station_address);
    Esp32BaseWeb::sendMetric("Station", value, "RS485 address");
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(config.travel_pulses));
    Esp32BaseWeb::sendMetric("Travel", value, "pulses");
    snprintf(value, sizeof(value), "%d / %d", config.open_direction, config.close_direction);
    Esp32BaseWeb::sendMetric("Direction", value, "open / close");
    Esp32BaseWeb::sendMetric("RS485", g_transport != nullptr && g_transport->isReady() ? "ready" : "not configured");
    Esp32BaseWeb::sendMetric("Action", g_action_runtime != nullptr && g_action_runtime->isBusy() ? "running" : "idle");
    Esp32BaseWeb::endMetricGrid();

    Esp32BaseWeb::beginPanel("Run");
    Esp32BaseWeb::sendChunk("<div class='actions'>");
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/door/open' onsubmit='return once(this)'><input type='submit' value='Open'></form>");
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/door/close' onsubmit='return once(this)'><input type='submit' value='Close'></form>");
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/door/stop' onsubmit='return once(this)'><input class='danger' type='submit' value='Stop'></form>");
    Esp32BaseWeb::sendChunk("</div>");
    Esp32BaseWeb::endPanel();

    sendActiveActionPanel();
    sendRecentRecordsPanel();

    Esp32BaseWeb::sendInfoRowCompactLink("Door parameters", "Station address, travel pulses, directions and safety limits are stored by Esp32Base App Config.", "App Config", "/esp32base/app-config", "Edit", Esp32BaseWeb::UI_INFO);
    Esp32BaseWeb::sendFooter();
}

void sendManualFeedApi(void) {
    if (!Esp32BaseWeb::checkPostAllowed("feed_manual")) {
        return;
    }
    if (g_feed_service == nullptr || g_rs485_master == nullptr || g_transport == nullptr || g_action_runtime == nullptr) {
        Esp32BaseWeb::sendJson(503, "{\"ok\":false,\"error\":\"service_unavailable\"}");
        return;
    }

    const FaFeedDeviceConfig config = readFeedConfig();
    char modeText[12] = "";
    (void)Esp32BaseWeb::getParam("mode", modeText, sizeof(modeText));
    const uint8_t amountMode = strcmp(modeText, "turns") == 0 ? FA_FEED_AMOUNT_TURNS_X1000 : FA_FEED_AMOUNT_MG;
    const uint32_t amount = readUIntParam("amount", 0u);

