tangyangguang/FarmAuto/firmware/master-esp32/src/webapp/fa_master_web.cpp
    if (g_action_runtime->isBusy()) {
        Esp32BaseWeb::sendJson(409, "{\"ok\":false,\"error\":\"action_busy\"}");
        return;
    }

    if (!g_transport->isReady()) {
        FaFeedService preview_service = *g_feed_service;
        FaMasterActionRequest action;
        FaFeedResult result;
        const uint8_t status = fa_feed_make_manual_action(&preview_service, &config, amountMode, amount, &action, &result);
        if (status != FA_STATUS_OK) {
            Esp32BaseWeb::beginJson(400);
            Esp32BaseWeb::sendChunk("\"ok\":false,\"status\":\"");
            Esp32BaseWeb::sendChunk(statusName(status));
            Esp32BaseWeb::sendChunk("\"");
            Esp32BaseWeb::endJson();
            return;
        }

        Esp32BaseWeb::beginJson(200);
        Esp32BaseWeb::sendChunk("\"ok\":true,\"dryRun\":true,\"transport\":\"not_configured\",\"actionId\":");
        sendNumber(action.action_id);
        Esp32BaseWeb::sendChunk(",\"stationAddress\":");
        sendNumber(config.station_address);
        Esp32BaseWeb::sendChunk(",\"targetPulses\":");
        sendNumber(result.target_pulses);
        Esp32BaseWeb::sendChunk(",\"speedPermille\":");
        sendNumber(action.speed_permille);
        Esp32BaseWeb::sendChunk(",\"message\":\"RS485 pins are not configured; action was built but not sent\"");
        Esp32BaseWeb::endJson();
        return;
    }

    FaMasterMotorConfig motor_config;
    uint8_t status = fa_feed_make_motor_config(&config, &motor_config);
    if (status != FA_STATUS_OK) {
        Esp32BaseWeb::beginJson(400);
        Esp32BaseWeb::sendChunk("\"ok\":false,\"status\":\"");
        Esp32BaseWeb::sendChunk(statusName(status));
        Esp32BaseWeb::sendChunk("\"");
        Esp32BaseWeb::endJson();
        return;
    }

    uint8_t request[FA_MAX_FRAME_LEN];
    size_t request_len = 0u;
    uint8_t seq = 0u;
    FaFrameResult frame_result = fa_rs485_master_build_set_motor_config(g_rs485_master,
                                                                        config.station_address,
                                                                        &motor_config,
                                                                        request,
                                                                        sizeof(request),
                                                                        &request_len,
                                                                        &seq);
    if (frame_result != FA_FRAME_OK) {
        sendFeedTransportError(500, "set_motor_config", "frame", frameResultName(frame_result));
        return;
    }

    FaMasterCommonResponse common;
    if (!transactAndParseCommon(config.station_address, seq, FA_CMD_SET_MOTOR_CONFIG, request, request_len, &common, "set_motor_config")) {
        return;
    }

    FaMasterActionRequest action;
    FaFeedResult result;
    status = fa_feed_make_manual_action(g_feed_service, &config, amountMode, amount, &action, &result);
    if (status != FA_STATUS_OK) {
        Esp32BaseWeb::beginJson(400);
        Esp32BaseWeb::sendChunk("\"ok\":false,\"status\":\"");
        Esp32BaseWeb::sendChunk(statusName(status));
        Esp32BaseWeb::sendChunk("\"");
        Esp32BaseWeb::endJson();
        return;
    }

    request_len = 0u;
    seq = 0u;
    frame_result = fa_rs485_master_build_start_action(g_rs485_master,
                                                      config.station_address,
                                                      &action,
                                                      request,
                                                      sizeof(request),
                                                      &request_len,
                                                      &seq);
    if (frame_result != FA_FRAME_OK) {
        sendFeedTransportError(500, "start_action", "frame", frameResultName(frame_result));
        return;
    }
    if (!transactAndParseCommon(config.station_address, seq, FA_CMD_START_ACTION, request, request_len, &common, "start_action")) {
        return;
    }

    FaActionRecordStart record_start = {};
    record_start.action_id = action.action_id;
    record_start.device_id = kSingleFeederDeviceId;
    record_start.bus_address = config.station_address;
    record_start.device_type = action.device_type;
    record_start.action_type = action.action_type;
    record_start.source_type = FA_ACTION_RECORD_SOURCE_MANUAL;
    record_start.source_id = 0u;
    record_start.target_pulses = result.target_pulses;
    record_start.amount_mode = amountMode;
    record_start.amount_value = amount;
    record_start.started_at_s = FaMasterActionRuntime::nowSeconds();
    const bool tracking = g_action_runtime->trackStartedAction(record_start);

    Esp32BaseWeb::beginJson(200);
    Esp32BaseWeb::sendChunk("\"ok\":true,\"dryRun\":false,\"transport\":\"ready\",\"actionId\":");
    sendNumber(action.action_id);
    Esp32BaseWeb::sendChunk(",\"stationAddress\":");
    sendNumber(config.station_address);
    Esp32BaseWeb::sendChunk(",\"targetPulses\":");
    sendNumber(result.target_pulses);
    Esp32BaseWeb::sendChunk(",\"speedPermille\":");
    sendNumber(action.speed_permille);
    Esp32BaseWeb::sendChunk(",\"tracking\":\"");
    Esp32BaseWeb::sendChunk(tracking ? "running" : g_action_runtime->lastError());
    Esp32BaseWeb::sendChunk("\"");
    Esp32BaseWeb::sendChunk(",\"message\":\"action accepted by station\"");
    Esp32BaseWeb::endJson();
}

}  // namespace

void fa_master_web_register_config(void) {
    Esp32BaseWeb::setDeviceName("FarmAuto");
    Esp32BaseWeb::setHomePath("/feed");
    Esp32BaseWeb::setHomeMode(Esp32BaseWeb::HOME_COMBINED);
    Esp32BaseWeb::setSystemNavMode(Esp32BaseWeb::SYSTEM_NAV_SECTION);
    Esp32BaseAppConfig::setTitle("FarmAuto Config");
    Esp32BaseAppConfig::addGroup({"feeder", "Feeder"});
    Esp32BaseAppConfig::addGroup({"door", "Door"});
    Esp32BaseAppConfig::addGroup({"rs485", "RS485"});
    Esp32BaseAppConfig::addInt({"feeder", kNs, kStationAddress, "Station address", 1, 1, 127, 1, nullptr,
                                "RS485 address 1..127.", false, nullptr});
    Esp32BaseAppConfig::addInt({"feeder", kNs, kPulsesPerTurn, "Pulses per turn", 4320, 1, 200000, 1, "pulses",
                                "Output shaft encoder pulses per turn.", false, nullptr});
    Esp32BaseAppConfig::addInt({"feeder", kNs, kGramsPerTurnMg, "mg per turn", 8000, 1, 1000000, 1, "mg",
                                "Calibration for mg based feeding.", false, nullptr});
    Esp32BaseAppConfig::addInt({"feeder", kNs, kDirection, "Direction", 1, -1, 1, 1, nullptr,
                                "1 forward, -1 reverse.", false, nullptr});
    Esp32BaseAppConfig::addInt({"feeder", kNs, kSpeedPermille, "Speed", 800, 1, 1000, 1, "permille",
                                "Motor speed request.", false, nullptr});
    Esp32BaseAppConfig::addInt({"feeder", kNs, kOverCurrentMa, "Over-current", 2000, 1, 10000, 1, "mA",
                                "Station protection threshold.", false, nullptr});
    Esp32BaseAppConfig::addInt({"feeder", kNs, kMaxRunMs, "Max run", 60000, 100, 600000, 100, "ms",
                                "Single action timeout.", false, nullptr});
    Esp32BaseAppConfig::addInt({"feeder", kNs, kMaxActionPulses, "Max pulses", 432000, 1, 2000000, 1, "pulses",
                                "Single action pulse limit.", false, nullptr});
    Esp32BaseAppConfig::addInt({"door", kDoorNs, kDoorStationAddress, "Station address", 2, 1, 127, 1, nullptr,
                                "RS485 address 1..127.", false, nullptr});
    Esp32BaseAppConfig::addInt({"door", kDoorNs, kDoorPulsesPerTurn, "Pulses per turn", 4320, 1, 200000, 1, "pulses",
                                "Output shaft encoder pulses per turn.", false, nullptr});
    Esp32BaseAppConfig::addInt({"door", kDoorNs, kDoorTravelPulses, "Travel pulses", 20000, 1, 2000000, 1, "pulses",
                                "Bounded travel for one open or close action.", false, nullptr});
    Esp32BaseAppConfig::addInt({"door", kDoorNs, kDoorOpenDirection, "Open direction", 1, -1, 1, 1, nullptr,
                                "1 forward, -1 reverse.", false, nullptr});
    Esp32BaseAppConfig::addInt({"door", kDoorNs, kDoorCloseDirection, "Close direction", -1, -1, 1, 1, nullptr,
                                "1 forward, -1 reverse.", false, nullptr});
    Esp32BaseAppConfig::addInt({"door", kDoorNs, kDoorSpeedPermille, "Speed", 700, 1, 1000, 1, "permille",
                                "Motor speed request.", false, nullptr});
    Esp32BaseAppConfig::addInt({"door", kDoorNs, kDoorOverCurrentMa, "Over-current", 2500, 1, 10000, 1, "mA",
                                "Station protection threshold.", false, nullptr});
    Esp32BaseAppConfig::addInt({"door", kDoorNs, kDoorMaxRunMs, "Max run", 30000, 100, 600000, 100, "ms",
                                "Single action timeout.", false, nullptr});
    Esp32BaseAppConfig::addInt({"door", kDoorNs, kDoorMaxActionPulses, "Max pulses", 100000, 1, 2000000, 1, "pulses",
                                "Single action pulse limit.", false, nullptr});
    Esp32BaseAppConfig::addInt({"rs485", FaRs485Config::NS, FaRs485Config::KEY_UART, "UART", 2, 1, 2, 1, nullptr,
                                "ESP32 hardware serial port.", true, nullptr});
    Esp32BaseAppConfig::addInt({"rs485", FaRs485Config::NS, FaRs485Config::KEY_RX_PIN, "RX pin", -1, -1, 39, 1, nullptr,
                                "-1 disables RS485 transport.", true, nullptr});
    Esp32BaseAppConfig::addInt({"rs485", FaRs485Config::NS, FaRs485Config::KEY_TX_PIN, "TX pin", -1, -1, 39, 1, nullptr,
                                "-1 disables RS485 transport; GPIO34-39 are input-only and invalid here.", true, nullptr});
    Esp32BaseAppConfig::addInt({"rs485", FaRs485Config::NS, FaRs485Config::KEY_DE_PIN, "DE pin", -1, -1, 39, 1, nullptr,
                                "Driver enable pin; GPIO34-39 are input-only and invalid here.", true, nullptr});
    Esp32BaseAppConfig::addInt({"rs485", FaRs485Config::NS, FaRs485Config::KEY_BAUD, "Baud", 115200, 9600, 1000000, 1, "bps",
                                "Default bus rate is 115200.", true, nullptr});
    Esp32BaseAppConfig::addInt({"rs485", FaRs485Config::NS, FaRs485Config::KEY_TIMEOUT_MS, "Timeout", 80, 20, 2000, 1, "ms",
                                "Single request timeout.", true, nullptr});
}

void fa_master_web_register_routes(FaFeedService *feed_service,
                                   FaDoorService *door_service,
                                   FaRs485Master *rs485_master,
                                   FaRs485Transport *transport,
                                   FaMasterActionRuntime *action_runtime) {
    g_feed_service = feed_service;
    g_door_service = door_service;
    g_rs485_master = rs485_master;
    g_transport = transport;
    g_action_runtime = action_runtime;
    Esp32BaseWeb::addPage("/feed", "Feed", sendFeedPage);
    Esp32BaseWeb::addPage("/door", "Door", sendDoorPage);
    Esp32BaseWeb::addApi("/api/feed/manual", sendManualFeedApi);
    Esp32BaseWeb::addApi("/api/door/open", sendDoorOpenApi);
    Esp32BaseWeb::addApi("/api/door/close", sendDoorCloseApi);
    Esp32BaseWeb::addApi("/api/door/stop", sendDoorStopApi);
}
